posts/real-world-vs-kaggle.org
#+BEGIN_COMMENT
.. title: Real-World vs Kaggle
.. slug: real-world-vs-kaggle
.. date: 2018-08-04 18:02:24 UTC-07:00
.. tags: basics
.. category: basics
.. link: 
.. description: How kaggle competitions differ from real-world deployments.
.. type: text
#+END_COMMENT

* A Real World Pipeline
  - What is the business problem that you are trying to solve?
  - What is the formal version of the problem?
  - How do you collect data?
  - How do you preprocess the data?
  - How do you create the model?
    + what is the appropriate algorithm?
    + what is the correct metric?
  - How do you evaluate the model in a real world situation?
  - How do you deploy the model?
    + How do you monitor its performance?
    + How do you update it over time?
* A Competition Pipeline
  - How do you pre-process the data?
  - How do you create the model?
* So, how do you use a competition then?
  - It's good to learn about machine learning
  - It' not just about the algorithms, let the data guide what you do
  - Try to be creative and do things that haven't been done before
