cache/posts/real-world-vs-kaggle.html
<div id="outline-container-org5ac0b00" class="outline-2">
<h2 id="org5ac0b00">A Real World Pipeline</h2>
<div class="outline-text-2" id="text-org5ac0b00">
<ul class="org-ul">
<li>What is the business problem that you are trying to solve?</li>
<li>What is the formal version of the problem?</li>
<li>How do you collect data?</li>
<li>How do you preprocess the data?</li>
<li>How do you create the model?
<ul class="org-ul">
<li>what is the appropriate algorithm?</li>
<li>what is the correct metric?</li>
</ul></li>
<li>How do you evaluate the model in a real world situation?</li>
<li>How do you deploy the model?
<ul class="org-ul">
<li>How do you monitor its performance?</li>
<li>How do you update it over time?</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9ed4319" class="outline-2">
<h2 id="org9ed4319">A Competition Pipeline</h2>
<div class="outline-text-2" id="text-org9ed4319">
<ul class="org-ul">
<li>How do you pre-process the data?</li>
<li>How do you create the model?</li>
</ul>
</div>
</div>
<div id="outline-container-orgeec38f0" class="outline-2">
<h2 id="orgeec38f0">So, how do you use a competition then?</h2>
<div class="outline-text-2" id="text-orgeec38f0">
<ul class="org-ul">
<li>It's good to learn about machine learning</li>
<li>It' not just about the algorithms, let the data guide what you do</li>
<li>Try to be creative and do things that haven't been done before</li>
</ul>
</div>
</div>
